In [1]:
import pandas as pd
import numpy as np

In [2]:
purchase_data = "purchase_data.csv"
purchase_data = pd.read_csv(purchase_data)
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [3]:
purchase_data_original = purchase_data.copy()

In [4]:
#Look at data types
purchase_data.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

In [5]:
purchase_id_count = purchase_data["Purchase ID"].count()
purchase_id_count

780

In [9]:
#Find the series of unique players, get the count, and assign the value to the variable. 
player_count = purchase_data["SN"].unique()
player_count = pd.Series(player_count)
player_count = player_count.count()
player_count

576

In [14]:
total_players = pd.DataFrame({"Total Players": [player_count]})
total_players

   Total Players
0            576

In [15]:
# Extract Purchasing Analysis Data from Purchasing Data datafram
items_df= purchase_data[["Item ID", "Item Name", "Price"]]

In [16]:
# Find number of unique items
unique_items = items_df["Item ID"].unique()
unique_items = pd.Series(unique_items)
unique_items = unique_items.count()

In [17]:
#Find average, number of purchases, and total revenue
average= items_df["Price"].mean()
num_of_purchase = purchase_data["Purchase ID"].count()
total_revenue = items_df["Price"].sum()

In [18]:
#Create dataframe with results
purchase_analysis = pd.DataFrame({"Unique Items": [unique_items], "Average": [average], "Total Purchases": [num_of_purchase], "Total Revenue":[total_revenue] })
purchase_analysis

   Unique Items   Average  Total Purchases  Total Revenue
0           179  3.050987              780        2379.77

In [23]:
#Recast results with appropriate formatting
purchase_analysis[["Average", "Total Revenue"]] = "$"+round(purchase_analysis[["Average", "Total Revenue"]], 2).astype(str)
purchase_analysis

   Unique Items Average  Total Purchases Total Revenue
0           179   $3.05              780      $2379.77

In [24]:
#Find gender types
gender_types = purchase_data["Gender"].value_counts()
gender_types

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [25]:
gender_male = "Male"
gender_female = "Female"
gender_other = "Other / Non-Disclosed"

In [26]:
#Find male players
male_players = purchase_data.loc[purchase_data["Gender"]=="Male"]
male_count = male_players["SN"].unique()
male_count = pd.Series(male_count)
male_count = male_count.count()

In [27]:
#Find female players
female_players = purchase_data.loc[purchase_data["Gender"]=="Female"]
female_count = female_players["SN"].unique()
female_count = pd.Series(female_count)
female_count = female_count.count()

In [28]:
#Find other players
other_players = purchase_data.loc[purchase_data["Gender"]=="Other / Non-Disclosed"]
other_count = other_players["SN"].unique()
other_count = pd.Series(other_count)
other_count = other_count.count()

In [29]:
per_of_total_m = round((male_count/player_count)*100, 2)
per_of_total_f = round((female_count/player_count)*100, 2)
per_of_total_o = round((other_count/player_count)*100, 2)

In [30]:
#Combine into dataframe
gender_demo = {"Total Count": male_count, "Percent of Total": per_of_total_m.astype(str) + '%', "Gender": gender_male}, {"Total Count": female_count, "Percent of Total": per_of_total_f.astype(str) + '%', "Gender": gender_female}, {"Total Count": other_count, "Percent of Total": per_of_total_o.astype(str) + '%', "Gender": gender_other}
gender_demo_df = pd.DataFrame(gender_demo)

#set index to gender
gender_demo_df = gender_demo_df.set_index("Gender")
gender_demo_df

                       Total Count Percent of Total
Gender
Male                           484           84.03%
Female                          81           14.06%
Other / Non-Disclosed           11            1.91%

In [31]:
gender_purchase = purchase_data.groupby("Gender")
gender_purchase.count()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [33]:
total_gender_purchases = gender_purchase["Price"].sum()
total_gender_purchases ="$" + round(total_gender_purchases, 2).astype(str)
total_gender_purchases

Gender
Female                    $361.94
Male                     $1967.64
Other / Non-Disclosed      $50.19
Name: Price, dtype: object

In [34]:
gender_groups = purchase_data.groupby("Gender").count()
gender_groups = gender_groups["Purchase ID"]
gender_groups

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [35]:
gender_average = gender_purchase["Price"].mean()
gender_average ="$" + round(gender_average, 2).astype(str)
gender_average

Gender
Female                    $3.2
Male                     $3.02
Other / Non-Disclosed    $3.35
Name: Price, dtype: object

In [36]:
total_gender_purchases_df = pd.DataFrame(total_gender_purchases)
counts = {female_count, male_count, other_count}
total_gender_purchases_df["Unique Counts"] = counts
total_gender_purchases_df

                          Price  Unique Counts
Gender
Female                  $361.94             81
Male                   $1967.64             11
Other / Non-Disclosed    $50.19            484

In [37]:
unique_gender_average = purchase_data.sum().Price /gender_demo_df["Total Count"]
unique_gender_average = gender_purchase.sum().Price/gender_demo_df["Total Count"]
unique_gender_average ="$" + round(unique_gender_average, 2).astype(str)
unique_gender_average

Gender
Female                   $4.47
Male                     $4.07
Other / Non-Disclosed    $4.56
dtype: object

In [38]:
purchase_analysis_gender = pd.DataFrame({"Purchase Count":gender_groups, "Average Purchase": gender_average, "Total Gender Purchases": total_gender_purchases, "Avg Total Purchase per Person": unique_gender_average})
purchase_analysis_gender

,Purchase Count,Average Purchase,Total Gender Purchases,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.2,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [39]:
print(purchase_data["Age"].max())
print(purchase_data["Age"].min())

45
7

In [40]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 50 ]
bin_names = [">10 yrs", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [41]:
#To create age bins for unique players, first isolate unique platers
player_age = purchase_data[["SN", "Age"]]
player_age = pd.DataFrame(player_age)
player_age = player_age.drop_duplicates("SN")
player_count_unique = player_age.count()
player_age

                SN  Age
0          Lisim78   20
1      Lisovynya38   40
2       Ithergue48   24
3    Chamassasya86   24
4        Iskosia90   23
..             ...  ...
773         Hala31   21
774     Jiskjask80   11
775     Aethedru70   21
777     Yathecal72   20
778        Sisur91    7

[576 rows x 2 columns]

In [42]:
#Use the bin/labels for ranges
pd.cut(player_age["Age"], bins, labels=bin_names).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [>10 yrs < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [43]:
#feed in the ranges to the dataframe
player_age["Age Range"] = pd.cut(player_age["Age"], bins, labels=bin_names)
player_age.head(15)

               SN  Age Age Range
0         Lisim78   20     20-24
1     Lisovynya38   40       40+
2      Ithergue48   24     20-24
3   Chamassasya86   24     20-24
4       Iskosia90   23     20-24
5         Yalae81   22     20-24
6       Itheria73   36     35-39
7     Iskjaskst81   20     20-24
8       Undjask33   22     20-24
9     Chanosian48   35     35-39
10      Inguron55   23     20-24
11   Haisrisuir60   23     20-24
12   Saelaephos52   21     20-24
13    Assjaskan73   22     20-24
14    Saesrideu94   35     35-39

In [44]:
#groupby ages of unique players
player_range = player_age.groupby("Age Range")
player_count = player_range["Age"].count()
player_count

Age Range
>10 yrs     17
10-14       22
15-19      107
20-24      258
25-29       77
30-34       52
35-39       31
40+         12
Name: Age, dtype: int64

In [45]:
#calculate percent of players of total range
age_demo = {"Player Count":player_count, "Percent of Total": round(player_count/player_count.sum()*100,2).astype(str) + '%'}
age_demo_df = pd.DataFrame(age_demo)
age_demo_df

           Player Count Percent of Total
Age Range
>10 yrs              17            2.95%
10-14                22            3.82%
15-19               107           18.58%
20-24               258           44.79%
25-29                77           13.37%
30-34                52            9.03%
35-39                31            5.38%
40+                  12            2.08%

In [46]:
#create slice
pd.cut(purchase_data["Age"], bins, labels=bin_names).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [>10 yrs < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [47]:
#add data
purchase_data["Age Range"] = pd.cut(purchase_data["Age"], bins, labels=bin_names)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [48]:
#finding age ranges of purchasers
purchaser_age_range = purchase_data.groupby("Age Range")
purchaser_age_count = purchaser_age_range["Age"].count()
purchaser_age_count

Age Range
>10 yrs     23
10-14       28
15-19      136
20-24      365
25-29      101
30-34       73
35-39       41
40+         13
Name: Age, dtype: int64

In [49]:
#finding age range of players
player_count

Age Range
>10 yrs     17
10-14       22
15-19      107
20-24      258
25-29       77
30-34       52
35-39       31
40+         12
Name: Age, dtype: int64

In [50]:
#finding average revenue by age bracket
purchaser_age_by_price = purchase_data.groupby("Age Range")["Price"].mean()
purchaser_age_by_price = "$" + round(purchaser_age_by_price, 2).astype(str)
purchaser_age_by_price

Age Range
>10 yrs    $3.35
10-14      $2.96
15-19      $3.04
20-24      $3.05
25-29       $2.9
30-34      $2.93
35-39       $3.6
40+        $2.94
Name: Price, dtype: object

In [51]:
#finding total revenue generated by purchaser by age bracket
purchaser_age_total_num = purchase_data.groupby("Age Range")["Price"].sum()
purchaser_age_total ="$" + round(purchaser_age_total_num, 2).astype(str)
purchaser_age_total

Age Range
>10 yrs      $77.13
10-14        $82.78
15-19       $412.89
20-24      $1114.06
25-29        $293.0
30-34        $214.0
35-39       $147.67
40+          $38.24
Name: Price, dtype: object

In [52]:
#finding average revenue generated by purchaser by age bracket
avg_purchase_by_person = purchaser_age_total_num/player_count
avg_purchase_by_person = "$" + round(avg_purchase_by_person, 2).astype(str)
avg_purchase_by_person

Age Range
>10 yrs    $4.54
10-14      $3.76
15-19      $3.86
20-24      $4.32
25-29      $3.81
30-34      $4.12
35-39      $4.76
40+        $3.19
dtype: object

In [53]:
#creating dataframe of purchasers by age bracket
purchaser_age_demo = {"Player Count":purchaser_age_count, "Average Purchase Price": purchaser_age_by_price, "Total Purchase Value": purchaser_age_total, "Avg Total Purchase per Person":avg_purchase_by_person}
purchaser_age_demo_df = pd.DataFrame(purchaser_age_demo)
purchaser_age_demo_df

,Player Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Range,,,,
>10 yrs,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,$1114.06,$4.32
25-29,101,$2.9,$293.0,$3.81
30-34,73,$2.93,$214.0,$4.12
35-39,41,$3.6,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

In [54]:
#Finding top spenders by grouping ids, calculating total purchases, and compiling dataframe
groupby_sn = purchase_data.groupby("SN")
total_money_spent = groupby_sn["Price"].sum()
total_purchase_count = groupby_sn["Purchase ID"].count()
average_purchase = total_money_spent/total_purchase_count
top_spenders=pd.DataFrame({"Purchase Count": total_purchase_count, "Average Purchase Price": average_purchase, "Total Purchase Value": total_money_spent})
top_spenders = top_spenders.sort_values("Total Purchase Value", ascending = False)
top_spenders = top_spenders.head(5)
top_spenders

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [55]:
#format top spenders dataframe
top_spenders["Average Purchase Price"] = "$" + round(top_spenders["Average Purchase Price"], 2).astype(str)
top_spenders["Total Purchase Value"] = "$" + round(top_spenders["Total Purchase Value"], 2).astype(str)
top_spenders

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                   $3.4               $13.62
Iskadarya95               3                  $4.37                $13.1

In [61]:
#finding most popular items solds
popular_items = purchase_data_original.groupby(["Item ID", "Item Name"])
popular_items_value = popular_items["Price"].sum()
popular_items_count = popular_items["Purchase ID"].count()
most_popular_items = pd.DataFrame({"Purchase Count": popular_items_count,"Item Price": popular_items_value/popular_items_count, "Total Purchase Value": popular_items_value})
most_popular_items = most_popular_items.sort_values("Purchase Count", ascending = False)
most_popular_items = most_popular_items.head(5)
most_popular_items

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

In [62]:
#formatting most popular items sold
most_popular_items[["Item Price", "Total Purchase Value"]] ="$" + round(most_popular_items[["Item Price", "Total Purchase Value"]], 2).astype(str)
most_popular_items["Purchase Count"] = most_popular_items["Purchase Count"].astype(int)
most_popular_items

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

In [59]:
#finding top sellers by revenue generators
top_sellers = purchase_data_original.groupby(["Item ID", "Item Name"])
top_sellers_total = top_sellers["Price"].sum()
top_sellers_count = top_sellers["Purchase ID"].count()
top_sellers_df = pd.DataFrame({"Purchase Count": top_sellers_count,"Item Price": top_sellers_total/top_sellers_count, "Total Purchase Value": top_sellers_total})
top_sellers_df = top_sellers_df.sort_values("Total Purchase Value", ascending = False)
top_sellers_df = top_sellers_df.head(5)
top_sellers_df

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80

In [60]:
#formatting highest revenue generating purchases
top_sellers_df[["Item Price", "Total Purchase Value"]] ="$" + round(top_sellers_df[["Item Price", "Total Purchase Value"]], 2).astype(str)
top_sellers_df["Purchase Count"] = top_sellers_df["Purchase Count"].astype(int)
top_sellers_df

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.9,$44.1
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.8